# tap "homebrew/services"

# Browsers
# cask "firefox"
# cask "google-chrome"
# cask "brave-browser"

# Productivity
cask "iterm2"
cask "hammerspoon"
cask "karabiner-elements"
brew "starship" # command prompt
cask "cron"
cask "obsidian"

# Unix
brew "gcc"
brew "openssl"
cask "gpg-suite-no-mail" # for gpg keys
brew "libyaml" # should come after openssl
brew "the_silver_searcher"
brew "zsh"
brew "dog" # better dig
brew "zoxide" # better cd
brew "fzf" # supports zoxide
brew "curl"
brew "wget"
brew "jq" # json parsing
brew "tree"
brew "exa" # rust "ls" replacement with tree support

# Development
# cask "jetbrains-toolbox"
# rider
# intellij
# datagrip
# clion

brew "git"
brew "vim"
brew "vaulted" # secure shell environment
brew "bat" # rust "cat" replacement
brew "git-delta" # better git diff
cask "gitup"
# Programming languages
brew "node"
brew "nvm"
brew "yarn"
cask "dotnet-sdk"
# tap "AdoptOpenJDK/openjdk"
# cask "adoptopenjdk8"
# cask "adoptopenjdk11"
# brew "leiningen"
# brew "gradle"

# brew "go"
# brew "crystal"

brew "rbenv"
brew "ruby-build"

# install programmer-y font
tap "homebrew/cask-fonts"
cask "font-fira-code"
cask "font-hack-nerd-font"

# Operations
brew "pdsh"

# Install Heroku
# tap "heorku/brew" # I've had issues with git credentials here
# brew "heroku"

# editor
cask "visual-studio-code"
cask "beyond-compare"

# ops dev
cask "docker"

#Mac App Store
brew "mas"

# How to handle from GitHub Actions
# Apps From the Apple App Store
mas "DaisyDisk", id: 411643860
mas "Evernote", id: 406056744
mas "OmniGraffle", id: 1142578753
mas "Pixelmator", id: 407963104
mas "The Unarchiver", id: 425424353
# mas "Fantastical", id: 975937182
# mas "Day One", id: 1055511498
# mas "Things", id: 904280696
# mas "Xcode", id: 497799835

# # OMC
# mas "Slack", id: 803453959
