tap "homebrew/services"

#Mac App Store
brew "mas"

# Unix
brew "git"
brew "gcc"
brew "openssl"
cask "gpg-suite-no-mail" # for gpg keys
brew "libyaml" # should come after openssl
brew "the_silver_searcher"
brew "vim"
brew "zsh"
brew "pdsh"
brew "vaulted"
brew "exa" # rust "ls" replacement with tree support
brew "bat" # rust "cat" replacement
brew "git-delta" # better git diff
brew "dog" # better dig

# Programming languages
# brew "node"
# brew "yarn"
# tap "AdoptOpenJDK/openjdk"
# cask "adoptopenjdk11"

brew "rbenv"
brew "ruby-build"


# install programmer-y font
tap "homebrew/cask-fonts"
cask "font-fira-code"
cask "font-hack-nerd-font"

# Instal Heroku
# tap "heorku/brew" # I've had issues with git credentials here
# brew "heroku"

# Console Prompt
brew "starship"

# editor
cask "visual-studio-code"
cask "beyond-compare"

# ops dev
cask "virtualbox"
cask "vagrant"

# sanity
cask "iterm2"
cask "hammerspoon"
cask "gitup"
cask "karabiner-elements"

# Browsers
cask "firefox"
cask "google-chrome"

cask "jetbrains-toolbox"
# rider
# intellij
# datagrip
# clion

# How to handle from GitHub Actions
# # Apps From the Apple App Store
# mas "DaisyDisk", id: 411643860
# mas "Day One", id: 1055511498
# mas "Evernote", id: 406056744
# mas "Fantastical", id: 975937182
# mas "OmniGraffle", id: 1142578753
# mas "Pixelmator", id: 407963104
# mas "The Unarchiver", id: 425424353
# mas "Things", id: 904280696
# mas "Xcode", id: 497799835

# # OMC
# mas "Trello", id: 1278508951
# mas "Slack", id: 803453959
