# tap "homebrew/services"

# Browsers
# cask "firefox"
# cask "google-chrome"
# cask "brave-browser"

# Productivity
cask "iterm2"
cask "hammerspoon"
cask "karabiner-elements"
brew "starship" # command prompt
cask "obsidian"
cask "the-unarchiver"
# calendar option? (fantastical)
# email option (superhuman)
tap "1password/tap"
cask "1password-cli"

# Unix
brew "gcc"
brew "openssl"
cask "gpg-suite-no-mail" # for gpg keys
brew "libyaml" # should come after openssl
brew "the_silver_searcher"
brew "zsh"
brew "dog" # better dig
brew "zoxide" # better cd
brew "fzf" # supports zoxide
brew "curl"
brew "wget"
brew "jq" # json parsing
brew "tree"
brew "eza" # rust "ls" replacement with tree support
brew "atuin" # better history
brew "bat" # rust "cat" replacement
brew "zellij" # better multi-plexer

# Development
# cask "jetbrains-toolbox"
# rider
# intellij
# datagrip
# clion

cask "visual-studio-code"
cask "beyond-compare"
brew "git"
brew "vim"
brew "vaulted" # secure shell environment
brew "git-delta" # better git diff
cask "gitup"

# Programming languages
brew "node"
brew "nvm"
brew "uv" # Python https://github.com/astral-sh/uv
brew "yarn"
brew "rbenv"
brew "ruby-build"
# dotnet via ./dotnet-install.sh

tap "AdoptOpenJDK/openjdk"
cask "openjdk8"
cask "openjdk11"
cask "openjdk17"

# brew "leiningen"
# brew "gradle"
# brew "go"
# brew "crystal"

# install programmer-y font
tap "homebrew/cask-fonts"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"

# Operations
brew "pdsh"
cask "docker"
brew "lazydocker"



#Mac App Store
brew "mas"

# How to handle from GitHub Actions
# Apps From the Apple App Store
mas "DaisyDisk", id: 411643860
mas "Things", id: 904280696
mas "Pixelmator", id: 407963104
mas "The Unarchiver", id: 425424353

# mas "Fantastical", id: 975937182
# mas "Day One", id: 1055511498
# mas "Xcode", id: 497799835
# mas "Evernote", id: 406056744
# mas "OmniGraffle", id: 1142578753

# # OMC
# mas "Slack", id: 803453959
